; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v12 ?v3)
             (pred_7 ?v8 ?v13)
             (pred_12 ?v12 ?v13)
             (pred_11 ?v2 ?v12 )
	     (pred_1 ?v12)
             (pred_9 ?v5)
             (pred_4 ?v8)
             (pred_2 ?v13)
             (pred_3 ?v12)
             (pred_10 ?v8)
             (pred_8 ?v12)
             (pred_6 ))



(:action op_5
:parameters (?v7 ?v9 ?v6 ?v11)
:precondition (and (pred_9 ?v7) (pred_9 ?v9) (pred_4 ?v6) (pred_2 ?v11)
          (pred_5 ?v7 ?v9) (pred_7 ?v6 ?v11)
                   (pred_12 ?v9 ?v11) (pred_1 ?v7) 
                   (pred_3 ?v9) (pred_10 ?v6))
:effect (and  (pred_8 ?v9) (not (pred_3 ?v9))))


(:action op_3
:parameters (?v7 ?v1)
:precondition (and (pred_9 ?v7) (pred_9 ?v1)
               (pred_1 ?v7) (pred_5 ?v7 ?v1) (pred_8 ?v1))
:effect (and (pred_1 ?v1) (not (pred_1 ?v7))))

(:action op_4
:parameters (?v7 ?v6)
:precondition (and (pred_9 ?v7) (pred_4 ?v6) 
                  (pred_1 ?v7) (pred_11 ?v6 ?v7) (pred_6 ))
:effect (and (pred_10 ?v6)
   (not (pred_11 ?v6 ?v7)) (not (pred_6 ))))


(:action op_1
:parameters (?v7 ?v10 ?v4)
:precondition (and (pred_9 ?v7) (pred_4 ?v10) (pred_4 ?v4)
                  (pred_1 ?v7) (pred_10 ?v4) (pred_11 ?v10 ?v7))
:effect (and (pred_10 ?v10) (pred_11 ?v4 ?v7)
        (not (pred_10 ?v4)) (not (pred_11 ?v10 ?v7))))

(:action op_2
:parameters (?v7 ?v6)
:precondition (and (pred_9 ?v7) (pred_4 ?v6) 
                  (pred_1 ?v7) (pred_10 ?v6))
:effect (and (pred_6 ) (pred_11 ?v6 ?v7) (not (pred_10 ?v6)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_24 obj_06 obj_25 obj_13 obj_29 obj_14 obj_15 obj_07 obj_01 obj_27 obj_09 obj_28 obj_12 obj_22 obj_19 obj_26 obj_23 obj_18 obj_05 obj_08 obj_11 obj_04 obj_16 obj_21 obj_30
    obj_03 obj_20
    obj_10 obj_17 obj_02
    )

    (:init
       (pred_6)

       (pred_9 obj_24)
       (pred_9 obj_06)
       (pred_9 obj_25)
       (pred_9 obj_13)
       (pred_9 obj_29)
       (pred_9 obj_14)
       (pred_9 obj_15)
       (pred_9 obj_07)
       (pred_9 obj_01)
       (pred_9 obj_27)
       (pred_9 obj_09)
       (pred_9 obj_28)
       (pred_9 obj_12)
       (pred_9 obj_22)
       (pred_9 obj_19)
       (pred_9 obj_26)
       (pred_9 obj_23)
       (pred_9 obj_18)
       (pred_9 obj_05)
       (pred_9 obj_08)
       (pred_9 obj_11)
       (pred_9 obj_04)
       (pred_9 obj_16)
       (pred_9 obj_21)
       (pred_9 obj_30)
       (pred_2 obj_03)
       (pred_2 obj_20)
       (pred_4 obj_10)
       (pred_4 obj_17)
       (pred_4 obj_02)

       (pred_5 obj_24 obj_14)
       (pred_5 obj_24 obj_06)
       (pred_5 obj_06 obj_15)
       (pred_5 obj_06 obj_25)
       (pred_5 obj_06 obj_24)
       (pred_5 obj_25 obj_07)
       (pred_5 obj_25 obj_13)
       (pred_5 obj_25 obj_06)
       (pred_5 obj_13 obj_01)
       (pred_5 obj_13 obj_29)
       (pred_5 obj_13 obj_25)
       (pred_5 obj_29 obj_27)
       (pred_5 obj_29 obj_13)
       (pred_5 obj_14 obj_09)
       (pred_5 obj_14 obj_15)
       (pred_5 obj_14 obj_24)
       (pred_5 obj_15 obj_28)
       (pred_5 obj_15 obj_07)
       (pred_5 obj_15 obj_06)
       (pred_5 obj_15 obj_14)
       (pred_5 obj_07 obj_12)
       (pred_5 obj_07 obj_01)
       (pred_5 obj_07 obj_25)
       (pred_5 obj_07 obj_15)
       (pred_5 obj_01 obj_22)
       (pred_5 obj_01 obj_27)
       (pred_5 obj_01 obj_13)
       (pred_5 obj_01 obj_07)
       (pred_5 obj_27 obj_19)
       (pred_5 obj_27 obj_29)
       (pred_5 obj_27 obj_01)
       (pred_5 obj_09 obj_26)
       (pred_5 obj_09 obj_28)
       (pred_5 obj_09 obj_14)
       (pred_5 obj_28 obj_23)
       (pred_5 obj_28 obj_12)
       (pred_5 obj_28 obj_15)
       (pred_5 obj_28 obj_09)
       (pred_5 obj_12 obj_18)
       (pred_5 obj_12 obj_22)
       (pred_5 obj_12 obj_07)
       (pred_5 obj_12 obj_28)
       (pred_5 obj_22 obj_05)
       (pred_5 obj_22 obj_19)
       (pred_5 obj_22 obj_01)
       (pred_5 obj_22 obj_12)
       (pred_5 obj_19 obj_08)
       (pred_5 obj_19 obj_27)
       (pred_5 obj_19 obj_22)
       (pred_5 obj_26 obj_11)
       (pred_5 obj_26 obj_23)
       (pred_5 obj_26 obj_09)
       (pred_5 obj_23 obj_04)
       (pred_5 obj_23 obj_18)
       (pred_5 obj_23 obj_28)
       (pred_5 obj_23 obj_26)
       (pred_5 obj_18 obj_16)
       (pred_5 obj_18 obj_05)
       (pred_5 obj_18 obj_12)
       (pred_5 obj_18 obj_23)
       (pred_5 obj_05 obj_21)
       (pred_5 obj_05 obj_08)
       (pred_5 obj_05 obj_22)
       (pred_5 obj_05 obj_18)
       (pred_5 obj_08 obj_30)
       (pred_5 obj_08 obj_19)
       (pred_5 obj_08 obj_05)
       (pred_5 obj_11 obj_04)
       (pred_5 obj_11 obj_26)
       (pred_5 obj_04 obj_16)
       (pred_5 obj_04 obj_23)
       (pred_5 obj_04 obj_11)
       (pred_5 obj_16 obj_21)
       (pred_5 obj_16 obj_18)
       (pred_5 obj_16 obj_04)
       (pred_5 obj_21 obj_30)
       (pred_5 obj_21 obj_05)
       (pred_5 obj_21 obj_16)
       (pred_5 obj_30 obj_08)
       (pred_5 obj_30 obj_21)
       (pred_3 obj_29)
       (pred_3 obj_12)
       (pred_3 obj_22)
       (pred_12  obj_29 obj_03)
       (pred_12  obj_12 obj_20)
       (pred_12  obj_22 obj_03)
       (pred_8 obj_24)
       (pred_8 obj_06)
       (pred_8 obj_25)
       (pred_8 obj_13)
       (pred_8 obj_14)
       (pred_8 obj_15)
       (pred_8 obj_07)
       (pred_8 obj_01)
       (pred_8 obj_27)
       (pred_8 obj_09)
       (pred_8 obj_28)
       (pred_8 obj_19)
       (pred_8 obj_26)
       (pred_8 obj_23)
       (pred_8 obj_18)
       (pred_8 obj_05)
       (pred_8 obj_08)
       (pred_8 obj_11)
       (pred_8 obj_04)
       (pred_8 obj_16)
       (pred_8 obj_21)
       (pred_8 obj_30)

       (pred_7  obj_10 obj_03)
       (pred_7  obj_17 obj_20)
       (pred_7  obj_02 obj_03)
       (pred_11 obj_10 obj_28)
       (pred_11 obj_17 obj_07)
       (pred_11 obj_02 obj_27)
       (pred_1 obj_23)
    )

    (:goal (and
       (pred_11 obj_17 obj_18)
       (pred_11 obj_02 obj_26)
    ))
(:constraints
  (always (not (pred_1 obj_12)))
)
)

; plan
1. (op_3 obj_23 obj_18)
   deleted: (pred_1 obj_23)
   added: (pred_1 obj_18)
   goals met: 0 of 2
2. (op_3 obj_18 obj_05)
   deleted: (pred_1 obj_18)
   added: (pred_1 obj_05)
   goals met: 0 of 2
3. (op_3 obj_05 obj_08)
   deleted: (pred_1 obj_05)
   added: (pred_1 obj_08)
   goals met: 0 of 2
4. (op_3 obj_08 obj_19)
   deleted: (pred_1 obj_08)
   added: (pred_1 obj_19)
   goals met: 0 of 2
5. (op_3 obj_19 obj_27)
   deleted: (pred_1 obj_19)
   added: (pred_1 obj_27)
   goals met: 0 of 2
6. (op_4 obj_27 obj_02)
   deleted: (pred_11 obj_02 obj_27) (pred_6)
   added: (pred_10 obj_02)
   goals met: 0 of 2
7. (op_3 obj_27 obj_01)
   deleted: (pred_1 obj_27)
   added: (pred_1 obj_01)
   goals met: 0 of 2
8. (op_3 obj_01 obj_07)
   deleted: (pred_1 obj_01)
   added: (pred_1 obj_07)
   goals met: 0 of 2
9. (op_1 obj_07 obj_17 obj_02)
   deleted: (pred_10 obj_02) (pred_11 obj_17 obj_07)
   added: (pred_10 obj_17) (pred_11 obj_02 obj_07)
   goals met: 0 of 2
10. (op_5 obj_07 obj_12 obj_17 obj_20)
   deleted: (pred_3 obj_12)
   added: (pred_8 obj_12)
   goals met: 0 of 2
11. (op_3 obj_07 obj_15)
   deleted: (pred_1 obj_07)
   added: (pred_1 obj_15)
   goals met: 0 of 2
12. (op_3 obj_15 obj_14)
   deleted: (pred_1 obj_15)
   added: (pred_1 obj_14)
   goals met: 0 of 2
13. (op_3 obj_14 obj_09)
   deleted: (pred_1 obj_14)
   added: (pred_1 obj_09)
   goals met: 0 of 2
14. (op_3 obj_09 obj_26)
   deleted: (pred_1 obj_09)
   added: (pred_1 obj_26)
   goals met: 0 of 2
15. (op_3 obj_26 obj_23)
   deleted: (pred_1 obj_26)
   added: (pred_1 obj_23)
   goals met: 0 of 2
16. (op_3 obj_23 obj_18)
   deleted: (pred_1 obj_23)
   added: (pred_1 obj_18)
   goals met: 0 of 2
17. (op_2 obj_18 obj_17)
   deleted: (pred_10 obj_17)
   added: (pred_6) (pred_11 obj_17 obj_18)
   goals met: 1 of 2
18. (op_3 obj_18 obj_23)
   deleted: (pred_1 obj_18)
   added: (pred_1 obj_23)
   goals met: 1 of 2
19. (op_3 obj_23 obj_28)
   deleted: (pred_1 obj_23)
   added: (pred_1 obj_28)
   goals met: 1 of 2
20. (op_3 obj_28 obj_15)
   deleted: (pred_1 obj_28)
   added: (pred_1 obj_15)
   goals met: 1 of 2
21. (op_3 obj_15 obj_07)
   deleted: (pred_1 obj_15)
   added: (pred_1 obj_07)
   goals met: 1 of 2
22. (op_4 obj_07 obj_02)
   deleted: (pred_11 obj_02 obj_07) (pred_6)
   added: (pred_10 obj_02)
   goals met: 1 of 2
23. (op_3 obj_07 obj_15)
   deleted: (pred_1 obj_07)
   added: (pred_1 obj_15)
   goals met: 1 of 2
24. (op_3 obj_15 obj_14)
   deleted: (pred_1 obj_15)
   added: (pred_1 obj_14)
   goals met: 1 of 2
25. (op_3 obj_14 obj_09)
   deleted: (pred_1 obj_14)
   added: (pred_1 obj_09)
   goals met: 1 of 2
26. (op_3 obj_09 obj_26)
   deleted: (pred_1 obj_09)
   added: (pred_1 obj_26)
   goals met: 1 of 2
27. (op_2 obj_26 obj_02)
   deleted: (pred_10 obj_02)
   added: (pred_6) (pred_11 obj_02 obj_26)
   goals met: 2 of 2
